emacs.d.org
** Dashboard

#+begin_src emacs-lisp :tangle ./lisp/init-dashboard.el

  (use-package dashboard
    :diminish (dashboard-mode)
    :functions (all-the-icons-faicon
                all-the-icons-material
                winner-undo
                widget-forward)
    :custom-face (dashboard-heading ((t (:inherit (font-lock-string-face bold)))))
    :bind (("<f2>" . open-dashboard)
           :map dashboard-mode-map
           ("R"    . restore-previous-session)
           ("L"    . restore-session)
           ("S"    . open-org-file)
           ("U"    . update-config-and-packages)
           ("q"    . quit-dashboard)
           ("h"    . dashboard-hydra/body)
           ("?"    . dashboard-hydra/body))
    :hook (dashboard-mode . (lambda () (setq-local frame-title-format "")))
    :preface
    (defun my/dashboard-banner ()
      (defvar package-count 0)

      (when (bound-and-true-p package-alist)
        (setq package-count (length package-activated-list)))
      (when (boundp 'straight--profile-cache)
        (setq package-count (+ (hash-table-size straight--profile-cache) package-count)))

      (setq dashboard-init-info
            (format "%d packages loaded in %.3f seconds\n"
                    package-count
                    (float-time (time-subtract after-init-time before-init-time)))))
    :init
    (add-hook 'after-init-hook     'dashboard-refresh-buffer)
    (add-hook 'dashboard-mode-hook 'my/dashboard-banner)

    (setq dashboard-startup-banner    'logo
          dashboard-center-content    t
          dashboard-show-shortcuts    nil
          dashboard-set-footer        t
          dashboard-set-init-info     t
          dashboard-set-file-icons    t
          dashboard-page-separator    "\n\f\n"
          dashboard-set-heading-icons t
          dashboard-items             '((recents   . 5)
                                        (bookmarks . 5)
                                        (projects  . 5))
          dashboard-heading-icons     '((recents   . "file-text")
                                        (bookmarks . "bookmark")
                                        (projects  . "briefcase"))

          dashboard-set-navigator t
          dashboard-navigator-buttons
          `(((,(when (icons-displayable-p)
                 (all-the-icons-material "restore" :height 1.35 :v-adjust -0.24))
              "Restore" "Restore previous session"
              (lambda (&rest _)))
             (,(when (icons-displayable-p)
                 (all-the-icons-octicon "tools" :height 1.0 :v-adjust 0.0))
              "Settings" "Open org file"
              (lambda (&rest _) ))
             (,(when (icons-displayable-p)
                 (all-the-icons-material "update" :height 1.35 :v-adjust -0.24))
              "Update" "Update Emacs"
              (lambda (&rest _) (update-packages)))
             (,(if (icons-displayable-p)
                   (all-the-icons-faicon "question" :height 1.2 :v-adjust -0.1)
                 "?")
              "" "Help (?/h)"
              (lambda (&rest _) (dashboard-hydra/body))
              font-lock-string-face))))

    (dashboard-setup-startup-hook)
    :config
    (defvar dashboard-recover-layout-p nil
      "Wether recovers the layout.")

    (defun dashboard-goto-recent-files ()
      "Go to recent files."
      (interactive)
      (let ((func (local-key-binding "r")))
        (and func (funcall func))))

    (defun dashboard-goto-projects ()
      "Go to projects."
      (interactive)
      (let ((func (local-key-binding "p")))
        (and func (funcall func))))

    (defun dashboard-goto-bookmarks ()
      "Go to bookmarks."
      (interactive)
      (let ((func (local-key-binding "m")))
        (and func (funcall func))))

    (defun open-dashboard ()
      "Open the *dashboard* buffer and jump to the first widget."
      (interactive)
      ;; Check if need to recover layout
      (if (> (length (window-list-1))
             ;; exclude `treemacs' window
             (if (and (fboundp 'treemacs-current-visibility)
                      (eq (treemacs-current-visibility) 'visible))
                 2
               1))
          (setq dashboard-recover-layout-p t))

      (delete-other-windows)

      ;; Refresh dashboard buffer
      (when (get-buffer dashboard-buffer-name)
        (kill-buffer dashboard-buffer-name))
      (dashboard-insert-startupify-lists)
      (switch-to-buffer dashboard-buffer-name)

      ;; Jump to the first section
      (dashboard-goto-recent-files))

    (defun quit-dashboard ()
      "Quit dashboard window."
      (interactive)
      (quit-window t)
      (when (and dashboard-recover-layout-p
                 (bound-and-true-p winner-mode))
        (winner-undo)
        (setq dashboard-recover-layout-p nil))))

#+end_src

** Dashboard in emacsclient

Lauches the dashboard in a emacsclient

#+begin_src emacs-lisp :tangle ./lisp/init-dashboard.el

  ;; (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-dashboard.el
	
  (provide 'init-dashboard)

#+end_src

* Edit

Editing configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  ;; -*- lexical-binding: t -*-
	
  (require 'init-evil)
  (require 'init-basic)

#+end_src

** Russian keyboard

#+begin_src emacs-lisp :tangle ./lisp/init-basic.el

  (defun reverse-input-method (input-method)
    "Build the reverse mapping of single letters from INPUT-METHOD."
    (interactive
     (list (read-input-method-name "Use input method (default current): ")))
    (if (and input-method (symbolp input-method))
        (setq input-method (symbol-name input-method)))
    (let ((current current-input-method)
          (modifiers '(nil (control) (meta) (control meta))))
      (when input-method
        (activate-input-method input-method))
      (when (and current-input-method quail-keyboard-layout)
        (dolist (map (cdr (quail-map)))
          (let* ((to (car map))
                 (from (quail-get-translation
                        (cadr map) (char-to-string to) 1)))
            (when (and (characterp from) (characterp to))
              (dolist (mod modifiers)
                (define-key local-function-key-map
                  (vector (append mod (list from)))
                  (vector (append mod (list to)))))))))
      (when input-method
        (activate-input-method current))))

  (reverse-input-method 'russian-computer)

#+end_src

** delete-selection

Delete selection if you insert

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el
	
  (use-package delsel
    :ensure nil
    :hook (after-init . delete-selection-mode))

#+end_src

** auto-revert

Automatically reload files was modified by external program

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el
	
  (use-package autorevert
    :ensure nil
    :diminish
    :hook (after-init . global-auto-revert-mode))

#+end_src

** goto-addr

Click to browse URL or to send to e-mail address

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package goto-addr
    :ensure nil
    :hook ((text-mode . goto-address-mode)
           (prog-mode . goto-address-prog-mode)))

#+end_src

** avy

Jump to things in Emacs tree-style

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el
	
  (use-package avy
    :bind (:map evil-normal-state-map
           ("/" . avy-goto-char-timer)
           :map evil-visual-state-map
           ("/" . avy-goto-char-timer)
           :map evil-motion-state-map
           ("/" . avy-goto-char-timer))
    :config
    (setq avy-all-windows     nil
          avy-timeout-seconds 0.4))

#+end_src

** ace-link

Quickly follow links

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package ace-link
    :hook (after-init . ace-link-setup-default)
    :config
    (leader-key-def
      "bu" 'ace-link-addr))
	
#+end_src

** aggressive-indent

Minor mode to aggressively keep your code always indented

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package aggressive-indent
    :diminish
    :hook ((after-init . global-aggressive-indent-mode)
           ;; FIXME: Disable in big files due to the performance issues
           ;; https://github.com/Malabarba/aggressive-indent-mode/issues/73
           (find-file . (lambda ()
                          (if (> (buffer-size) (* 3000 80))
                              (aggressive-indent-mode -1)))))
    :config
    ;; Disable in some modes
    (dolist (mode '(asm-mode html-mode css-mode))
      (push mode aggressive-indent-excluded-modes))

    ;; Disable in some commands
    (add-to-list 'aggressive-indent-protected-commands #'delete-trailing-whitespace t)

    ;; Be slightly less aggressive in C/C++/C#/Java/Go/Swift
    (add-to-list 'aggressive-indent-dont-indent-if
                 '(and (derived-mode-p 'c-mode 'c++-mode 'java-mode)
                       (null (string-match "\\([;{}]\\|\\b\\(if\\|for\\|while\\)\\b\\)"
                                           (thing-at-point 'line))))))

#+end_src

** comment-dwim-2

An all-in-one comment command to rule them all

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package comment-dwim-2
    :init
    (leader-key-def
      "/" (lambda ()
            (interactive)
            (if (eq major-mode 'org-mode)
                (org-comment-dwim-2)
              (comment-dwim-2)))))

#+end_src

