lisp/init-edit.el
;; -*- lexical-binding: t -*-

(require 'init-evil)
(require 'init-basic)

(use-package delsel
  :ensure nil
  :hook (after-init . delete-selection-mode))

(use-package autorevert
  :ensure nil
  :diminish
  :hook (after-init . global-auto-revert-mode))

(use-package goto-addr
  :ensure nil
  :hook ((text-mode . goto-address-mode)
         (prog-mode . goto-address-prog-mode)))

(use-package avy
  :bind (:map evil-normal-state-map
         ("/" . avy-goto-char-timer)
         :map evil-visual-state-map
         ("/" . avy-goto-char-timer)
         :map evil-motion-state-map
         ("/" . avy-goto-char-timer))
  :config
  (setq avy-all-windows     nil
        avy-timeout-seconds 0.4))

(use-package ace-link
  :hook (after-init . ace-link-setup-default)
  :config
  (leader-key-def
    "bu" 'ace-link-addr))

(use-package aggressive-indent
  :diminish
  :hook ((after-init . global-aggressive-indent-mode)
         ;; FIXME: Disable in big files due to the performance issues
         ;; https://github.com/Malabarba/aggressive-indent-mode/issues/73
         (find-file . (lambda ()
                        (if (> (buffer-size) (* 3000 80))
                            (aggressive-indent-mode -1)))))
  :config
  ;; Disable in some modes
  (dolist (mode '(asm-mode html-mode css-mode))
    (push mode aggressive-indent-excluded-modes))

  ;; Disable in some commands
  (add-to-list 'aggressive-indent-protected-commands #'delete-trailing-whitespace t)

  ;; Be slightly less aggressive in C/C++/C#/Java/Go/Swift
  (add-to-list 'aggressive-indent-dont-indent-if
               '(and (derived-mode-p 'c-mode 'c++-mode 'java-mode)
                     (null (string-match "\\([;{}]\\|\\b\\(if\\|for\\|while\\)\\b\\)"
                                         (thing-at-point 'line))))))

(use-package comment-dwim-2
  :init
  (leader-key-def
    "/" (lambda ()
          (interactive)
          (if (eq major-mode 'org-mode)
              (org-comment-dwim-2)
            (comment-dwim-2)))))
