emacs.d.org
** drag-stuff

Drag stuff (lines, words, region, etc...) around

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package drag-stuff
    :diminish
    :after evil
    :hook (after-init . drag-stuff-global-mode)
    :bind ((:map evil-visual-state-map
                 ("C-M-k" . drag-stuff-up)
                 ("C-M-j" . drag-stuff-down))
           (:map evil-normal-state-map
                 ("M-k"   . drag-stuff-up)
                 ("M-j"   . drag-stuff-down))
           (:map evil-insert-state-map
                 ("M-k"   . drag-stuff-up)
                 ("M-j"   . drag-stuff-down)))
    :config
    (add-to-list 'drag-stuff-except-modes 'org-mode))

#+end_src

** ediff

A comprehensive visual interface to diff & patch

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package ediff
    :ensure nil
    :hook(;; show org ediffs unfolded
          ;; (ediff-prepare-buffer . outline-show-all)
          ;; restore window layout when done
          (ediff-quit . winner-undo))
    :config
    (setq ediff-window-setup-function       'ediff-setup-windows-plain)
    (setq ediff-split-window-function       'split-window-horizontally)
    (setq ediff-merge-split-window-function 'split-window-horizontally))

#+end_src

** electric-pair

Automatic parenthesis pairing

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package electric-pair
    :ensure nil
    :hook (after-init . electric-pair-mode)
    :init
    (setq electric-pair-inhibit-predicate 'electric-pair-conservative-inhibit))

#+end_src

** expand-region

Increase selected region by semantic units

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package expand-region
    :after evil
    :bind (:map evil-visual-state-map
                ("M-k" . er/expand-region)
                ("M-j" . er/contract-region)))

#+end_src

** multiplite-regiton

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package multiple-cursors
    :bind (("C-S-c C-S-c"   . mc/edit-lines)
           ("C->"           . mc/mark-next-like-this)
           ("C-<"           . mc/mark-previous-like-this)
           ("C-c C-<"       . mc/mark-all-like-this)
           ("C-M->"         . mc/skip-to-next-like-this)
           ("C-M-<"         . mc/skip-to-previous-like-this)
           ("s-<mouse-1>"   . mc/add-cursor-on-click)
           ("C-S-<mouse-1>" . mc/add-cursor-on-click)
           :map mc/keymap
           ("C-|"           . mc/vertical-align-with-space)))

#+end_src

** smart-region

Smartly select region, rectangle, multi cursors

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package smart-region
    :hook (after-init . smart-region-on))

#+end_src

** Goto
*** Goto last change

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el
	
  (use-package goto-chg
    :bind ("C-," . goto-last-change))

#+end_src

*** goto-last-point

Record and jump to the last point in the buffer

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el
	
  (use-package goto-last-point
    :diminish
    :bind ("C-M-," . goto-last-point)
    :hook (after-init . goto-last-point-mode))

#+end_src

*** Preview when `goto-line'

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el
	
  (use-package goto-line-preview
    :bind ([remap goto-line] . goto-line-preview))

#+end_src

** subword

Handling capitalized subwords in a nomenclature

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package subword
    :ensure nil
    :diminish
    :hook ((prog-mode        . subword-mode)
           (minibuffer-setup . subword-mode)))

#+end_src

** origami

Flexible text folding

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package origami
    :hook (prog-mode . origami-mode)
    :init (setq origami-show-fold-header t)
    :config (face-spec-reset-face 'origami-fold-header-face))

#+end_src

** sudo-edit

Open files as another user

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package sudo-edit)

#+end_src

** pretty-symbols

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (use-package prettify-symbols
    :ensure nil
    :hook (after-init . global-prettify-symbols-mode)
    :init
    (defun my/org-load-prettify-symbols ()
      (interactive)
      (set-face-background 'org-block-begin-line "#282c34")
      (push '("#+begin_latex latex" . ? ) prettify-symbols-alist)
      (push '("#+end_latex"         . ? ) prettify-symbols-alist)
      (push '("\\\\"                . ?↵) prettify-symbols-alist))
    (defun my/latex-load-prettify-symbols ()
      (interactive)
      (push '("\\pm"           . ?±)  prettify-symbols-alist)
      (push '("\\mp"           . ?∓)  prettify-symbols-alist)
      (push '("\\left("        . ?\() prettify-symbols-alist)
      (push '("\\right)"       . ?\)) prettify-symbols-alist)
      (push '("\\left["        . ?\[) prettify-symbols-alist)
      (push '("\\right]"       . ?\]) prettify-symbols-alist)
      (push '("\\left\\{"      . ?\{) prettify-symbols-alist)
      (push '("\\right\\}"     . ?\}) prettify-symbols-alist)
      (push '("\\left|"        . ?|)  prettify-symbols-alist)
      (push '("\\right|"       . ?|)  prettify-symbols-alist)
      (push '("\\Bigl("        . ?\() prettify-symbols-alist)
      (push '("\\Bigr)"        . ?\)) prettify-symbols-alist)
      (push '("\\Bigl["        . ?\[) prettify-symbols-alist)
      (push '("\\Bigr]"        . ?\]) prettify-symbols-alist)
      (push '("\\Bigl\\{"      . ?\{) prettify-symbols-alist)
      (push '("\\Bigr\\}"      . ?\}) prettify-symbols-alist)
      (push '("\\mathbb{N}"    . ?ℕ) prettify-symbols-alist)
      (push '("\\mathbb{Z}"    . ?ℤ) prettify-symbols-alist)
      (push '("\\mathbb{Q}"    . ?ℚ) prettify-symbols-alist)
      (push '("\\mathbb{R}"    . ?ℝ) prettify-symbols-alist)
      (push '("\\mathbb{C}"    . ?ℂ) prettify-symbols-alist)
      (push '("\\not\\in"      . ?∉) prettify-symbols-alist)
      (push '("\\updownarrows" . ?⇅) prettify-symbols-alist)
      (push '("\\\\"           . ?↵) prettify-symbols-alist)))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-edit.el

  (provide 'init-edit)
	
#+end_src

* Elisp

Emacs Lisp configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-elisp.el

  ;; -*- lexical-binding: t -*-

#+end_src

** Emacs lisp mode

#+begin_src emacs-lisp :tangle ./lisp/init-elisp.el

  (use-package elisp-mode
    :ensure nil
    :hook (emacs-lisp-mode . (lambda ()
                               "Disable the checkdoc checker."
                               (setq-local flycheck-disabled-checkers
                                           '(emacs-lisp-checkdoc))))
    :config
    (when (boundp 'elisp-flymake-byte-compile-load-path)
      (add-to-list 'elisp-flymake-byte-compile-load-path load-path))

    ;; Syntax highlighting of known Elisp symbols
    (use-package highlight-defined
      :hook (emacs-lisp-mode . highlight-defined-mode)
      :init
      (setq highlight-defined-face-use-itself t)))

#+end_src

** helpful

A better help buffer

#+begin_src emacs-lisp :tangle ./lisp/init-elisp.el

  (use-package helpful
    :defines (counsel-describe-function-function
              counsel-describe-variable-function)
    :commands helpful--buffer
    :bind (([remap describe-key] . helpful-key)
           ([remap describe-symbol] . helpful-symbol)
           ("C-c C-d" . helpful-at-point)
           :map helpful-mode-map
           ("r" . remove-hook-at-point))
    :hook (helpful-mode . cursor-sensor-mode) ; for remove-advice button
    :init
    (with-eval-after-load 'counsel
      (setq counsel-describe-function-function #'helpful-callable
            counsel-describe-variable-function #'helpful-variable))

    (with-eval-after-load 'apropos
      ;; patch apropos buttons to call helpful instead of help
      (dolist (fun-bt '(apropos-function apropos-macro apropos-command))
        (button-type-put
         fun-bt 'action
         (lambda (button)
           (helpful-callable (button-get button 'apropos-symbol)))))
      (dolist (var-bt '(apropos-variable apropos-user-option))
        (button-type-put
         var-bt 'action
         (lambda (button)
           (helpful-variable (button-get button 'apropos-symbol))))))

    ;; Add remove buttons for advices
    ;; (define-advice helpful-update (:after () advice-remove-button)
    ;;   (when helpful--callable-p
    ;;     (add-button-to-remove-advice (helpful--buffer helpful--sym t) helpful--sym)))
    :config
    (with-no-warnings
      ;; Open the buffer in other window
      (defun my/helpful--navigate (button)
        "Navigate to the path this BUTTON represents."
        (find-file-other-window (substring-no-properties (button-get button 'path)))
        ;; We use `get-text-property' to work around an Emacs 25 bug:
        ;; http://git.savannah.gnu.org/cgit/emacs.git/commit/?id=f7c4bad17d83297ee9a1b57552b1944020f23aea
        (-when-let (pos (get-text-property button 'position
                                           (marker-buffer button)))
          (helpful--goto-char-widen pos)))
      (advice-add #'helpful--navigate :override #'my/helpful--navigate)))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-elisp.el
	
  (provide 'init-elisp)

#+end_src

* Evil

Evil configuration.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-evil.el
	
  ;; -*- lexical-binding: t -*-

  (require 'init-basic)

#+end_src

