emacs.d.org
** evil

#+begin_src emacs-lisp :tangle ./lisp/init-evil.el

  (use-package evil
    :hook (prog-mode . evil-mode)
    :bind ((:map evil-motion-state-map
                 ("RET"     . nil)
                 ("M-k"     . nil)
                 ("SPC"     . nil)
                 ("DEL"     . nil))
           (:map evil-normal-state-map
                 ("H"       . left-word)
                 ("L"       . right-word)
                 ("J"       . forward-paragraph)
                 ("K"       . backward-paragraph)
                 ("U"       . evil-redo)
                 ("SPC TAB" . evil-close-folds)
                 ("S-M-h"   . evil-window-increase-width)
                 ("S-M-l"   . evil-window-decrease-width)
                 ("S-M-k"   . evil-window-increase-height)
                 ("S-M-j"   . evil-window-decrease-height)
                 ("TAB"     . (lambda ()
                                (interactive)
                                (insert "\t"))))
           (:map evil-visual-state-map
                 ("H"       . left-word)
                 ("L"       . right-word)
                 ("J"       . forward-paragraph)
                 ("K"       . backward-paragraph))
           (:map evil-insert-state-map
                 ("M-k"     . nil)))
    :custom (evil-want-keybinding nil)
    :config
    (global-set-key (kbd "C-l") 'evil-window-right)
    (global-set-key (kbd "C-h") 'evil-window-left)
    (global-set-key (kbd "C-k") 'evil-window-up)
    (global-set-key (kbd "C-j") 'evil-window-down)

    (add-hook 'evil-visual-state-entry-hook (lambda () (prettify-symbols-mode -1)))
    (add-hook 'evil-visual-state-exit-hook  (lambda () (prettify-symbols-mode 1)))

    (use-package undo-fu)

    (setq evil-whan-fine-undo t
          evil-undo-system    'undo-fu
          evil-undo-function  'undo-fu-only-undo
          evil-redo-function  'undo-fu-only-redo))

#+end_src

** evil-collection

#+begin_src emacs-lisp :tangle ./lisp/init-evil.el

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src

** key-chord

#+begin_src emacs-lisp :tangle ./lisp/init-evil.el

  (use-package key-chord
    :after evil
    :hook (prog-mode . key-chord-mode)
    :config
    (setq key-chord-two-keys-delay 0.15)
    (key-chord-define evil-insert-state-map (kbd "jj") 'evil-normal-state)

    (define-key evil-insert-state-map "о" #'my/maybe-exit)

    (evil-define-command my/maybe-exit ()
      :repeat change
      (interactive)
      (insert "о")
      (let ((evt (read-event "" nil 0.18)))
        (cond
         ((null evt))
         ((and (integerp evt) (char-equal evt ?о))
          (delete-char -1)
          (evil-normal-state))
         (t (insert evt)))))
    )

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-evil.el
	
  (provide 'init-evil)

#+end_src

* Funcs

Define functions.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-funcs.el

  ;; -*- lexical-binding: t -*-
	
  (require 'cl-lib)
  (require 'init-custom)

#+end_src

** Open this file

#+begin_src emacs-lisp :tangle ./lisp/init-funcs.el

  (defun open-org-file ()
    "Open or create `.emacs.d.org'."
    (interactive))

#+end_src

** Misc

#+begin_src emacs-lisp :tangle ./lisp/init-funcs.el

  (defun create-scratch-buffer ()
    "Create a scratch buffer."
    (interactive)
    (switch-to-buffer (get-buffer-create "*scratch*"))
    (lisp-interaction-mode))

  (defun recompile-elpa ()
    "Recompile packages in elpa directory. Useful if you switch Emacs versions."
    (interactive)
    (if (fboundp 'async-byte-recompile-directory)
        (async-byte-recompile-directory package-user-dir)
      (byte-recompile-directory package-user-dir 0 t)))

  (defun icons-displayable-p ()
    "Return non-nil if `all-the-icons' is displayable."
    (and centaur-icon
         (display-graphic-p)
         (require 'all-the-icons nil t)))

  (defun centaur-set-variable (variable value &optional no-save)
    "Set the VARIABLE to VALUE, and return VALUE.

  Save to `custom-file' if NO-SAVE is nil."
    (customize-set-variable variable value))

  (defun my/current-line-empty-p ()
    (save-excursion
      (beginning-of-line)
      (looking-at-p "^[[:space:]]*$")))

  ;; (defun my/test ()
  ;;   (interactive)
  ;;   (my/inkscape-figures-create (test)))

#+end_src

** Pakcage repository (ELPA)

#+begin_src emacs-lisp :tangle ./lisp/init-funcs.el

  (defun set-package-archives (archives &optional refresh async no-save)
    "Set the package archives (ELPA).

  REFRESH is non-nil, will refresh archive contents.
  ASYNC specifies whether to perform the downloads in the background.
  Save to `custom-file' if NO-SAVE is nil."
    (interactive
     (list
      (intern (completing-read "Select package archives: "
                               (mapcar #'car centaur-package-archives-alist)))))
    ;; Set option
    (centaur-set-variable 'centaur-package-archives archives no-save)

    ;; Refresh if need
    (and refresh (package-refresh-contents async))

    (message "Set package archives to `%s'" archives))
  (defalias 'centaur-set-package-archives #'set-package-archives)

#+end_src

** Update

#+begin_src emacs-lisp :tangle ./lisp/init-funcs.el

  (defvar centaur--updating-packages nil)
  (defun update-packages (&optional sync)
    "Refresh package contents and update all packages.

  If SYNC is non-nil, the updating process is synchronous."
    (interactive)
    (when centaur--updating-packages
      (user-error "Still updating packages..."))

    (message "Updating packages...")
    (if (and (not sync)
             (require 'async nil t))
        (progn
          (setq centaur--updating-packages t)
          (async-start
           `(lambda ()
              ,(async-inject-variables "\\`\\(load-path\\)\\'")
              (require 'init-funcs)
              (require 'init-package)
              (upgrade-packages)
              (with-current-buffer auto-package-update-buffer-name
                (buffer-string)))
           (lambda (result)
             (setq centaur--updating-packages nil)
             (message "%s" result)
             (message "Updating packages...done"))))
      (progn
        (upgrade-packages)
        (message "Updating packages...done"))))
  (defalias 'centaur-update-packages #'update-packages)

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-funcs.el
	
  (provide 'init-funcs)

#+end_src

* Highlight

Highlighting configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  ;; -*- lexical-binding: t -*-
	
#+end_src

** Highlight the current line

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  (use-package hl-line
    :ensure nil
    :hook (after-init   . global-hl-line-mode))

#+end_src

** Highlight matching parens

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  (use-package paren
    :ensure nil
    :hook (after-init . show-paren-mode)
    :init (setq show-paren-when-point-inside-paren t
                show-paren-when-point-in-periphery t))

#+end_src

** Highlight symbols

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  (use-package symbol-overlay
    :diminish
    :functions (turn-off-symbol-overlay turn-on-symbol-overlay)
    :custom-face (symbol-overlay-default-face ((t (:inherit (region bold)))))
    :bind (("M-i" . symbol-overlay-put)
           ("M-n" . symbol-overlay-jump-next)
           ("M-p" . symbol-overlay-jump-prev)
           ("M-N" . symbol-overlay-switch-forward)
           ("M-P" . symbol-overlay-switch-backward)
           ("M-C" . symbol-overlay-remove-all)
           ([M-f3] . symbol-overlay-remove-all))
    :hook ((prog-mode . symbol-overlay-mode)
           (iedit-mode . turn-off-symbol-overlay)
           (iedit-mode-end . turn-on-symbol-overlay))
    :init (setq symbol-overlay-idle-time 0.1)
    (with-eval-after-load 'all-the-icons
      (setq symbol-overlay-faces
            '((:inherit (all-the-icons-blue   bold) :inverse-video t)
              (:inherit (all-the-icons-pink   bold) :inverse-video t)
              (:inherit (all-the-icons-yellow bold) :inverse-video t)
              (:inherit (all-the-icons-purple bold) :inverse-video t)
              (:inherit (all-the-icons-red    bold) :inverse-video t)
              (:inherit (all-the-icons-orange bold) :inverse-video t)
              (:inherit (all-the-icons-green  bold) :inverse-video t)
              (:inherit (all-the-icons-cyan   bold) :inverse-video t))))
    :config
    ;; Disable symbol highlighting while selecting
    (defun turn-off-symbol-overlay (&rest _)
      "Turn off symbol highlighting."
      (interactive)
      (symbol-overlay-mode -1))
    (advice-add #'set-mark :after #'turn-off-symbol-overlay)

    (defun turn-on-symbol-overlay (&rest _)
      "Turn on symbol highlighting."
      (interactive)

      (when (derived-mode-p 'prog-mode)
        (symbol-overlay-mode 1)))
    (advice-add #'deactivate-mark :after #'turn-on-symbol-overlay))

#+end_src

** Highlight indentions

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  (defun my/hig-restart ()
    (interactive)
    (if (eq major-mode 'emacs-lisp-mode)
        (progn
          (highlight-indent-guides-mode)
          (highlight-indent-guides-mode))))

  (leader-key-def
    "hr" 'my/hig-restart)
  ;; (add-hook 'after-save-hook 'my/hig-restart)

  (when (display-graphic-p)
    (use-package highlight-indent-guides
      :diminish
      :hook (prog-mode  . highlight-indent-guides-mode)
      :config
      (setq highlight-indent-guides-method     'character
            highlight-indent-guides-responsive 'top)

      (with-no-warnings
        ;; Don't display indentations in `swiper'
        (with-eval-after-load 'ivy
          (defun my/ivy-cleanup-indentation (str)
            "Clean up indentation highlighting in ivy minibuffer."
            (let ((pos 0)
                  (next 0)
                  (limit (length str))
                  (prop 'highlight-indent-guides-prop))
              (while (and pos next)
                (setq next (text-property-not-all pos limit prop nil str))
                (when next
                  (setq pos (text-property-any next limit prop nil str))
                  (ignore-errors
                    (remove-text-properties next pos '(display nil face nil) str))))))
          (advice-add #'ivy-cleanup-string :after #'my/ivy-cleanup-indentation)))))

#+end_src

** Colorize color names in buffers

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  (use-package rainbow-mode
    :diminish
    :hook (find-file . rainbow-mode)
    :config
    (with-no-warnings
      ;; HACK: Use overlay instead of text properties to override `hl-line' faces.
      ;; @see https://emacs.stackexchange.com/questions/36420
      (defun my/rainbow-colorize-match (color &optional match)
        (let* ((match (or match 0))
               (ov (make-overlay (match-beginning match) (match-end match))))
          (overlay-put ov 'ovrainbow t)
          (overlay-put ov 'face `((:foreground ,(if (> 0.5 (rainbow-x-color-luminance color))
                                                    "white" "black"))
                                  (:background ,color)))))
      (advice-add #'rainbow-colorize-match :override #'my/rainbow-colorize-match)

      (defun my/rainbow-clear-overlays ()
        "Clear all rainbow overlays."
        (remove-overlays (point-min) (point-max) 'ovrainbow t))
      (advice-add #'rainbow-turn-off :after #'my/rainbow-clear-overlays)))

#+end_src

