emacs.d.org
** Highlight TODO and similar keywords in comments and strings

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  (use-package hl-todo
    :bind (:map hl-todo-mode-map
           ([C-f3] . hl-todo-occur)
           ("C-c t p" . hl-todo-previous)
           ("C-c t n" . hl-todo-next)
           ("C-c t o" . hl-todo-occur))
    :hook (after-init . global-hl-todo-mode)
    :config
    (dolist (keyword '("BUG" "DEFECT" "ISSUE"))
      (cl-pushnew `(,keyword . ,(face-foreground 'error)) hl-todo-keyword-faces))
    (dolist (keyword '("WORKAROUND" "HACK" "TRICK"))
      (cl-pushnew `(,keyword . ,(face-foreground 'warning)) hl-todo-keyword-faces)))
	
#+end_src

** Highlight uncommitted changes using VC

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  (use-package diff-hl
    :custom-face
    (diff-hl-change ((t (:foreground ,(face-background 'highlight) :background nil))))
    (diff-hl-insert ((t (:background nil))))
    (diff-hl-delete ((t (:background nil))))
    :hook ((after-init . global-diff-hl-mode)
           (dired-mode . diff-hl-dired-mode))
    :init
    (setq diff-hl-draw-borders nil)
    :config
    ;; Highlight on-the-fly
    (diff-hl-flydiff-mode 1)

    ;; Set fringe style
    (setq-default fringes-outside-margins t)

    (with-no-warnings
      (defun my/diff-hl-fringe-bmp-function (_type _pos)
        "Fringe bitmap function for use as `diff-hl-fringe-bmp-function'."
        (define-fringe-bitmap 'my/diff-hl-bmp
          (vector #b11111100)
          1 8
          '(center t)))
      (setq diff-hl-fringe-bmp-function #'my/diff-hl-fringe-bmp-function)

      (unless (display-graphic-p)
        (setq diff-hl-margin-symbols-alist
              '((insert . " ") (delete . " ") (change . " ")
                (unknown . " ") (ignored . " ")))
        ;; Fall back to the display margin since the fringe is unavailable in tty
        (diff-hl-margin-mode 1)
        ;; Avoid restoring `diff-hl-margin-mode'
        (with-eval-after-load 'desktop
          (add-to-list 'desktop-minor-mode-table
                       '(diff-hl-margin-mode nil))))

      ;; Integration with magit
      (with-eval-after-load 'magit
        (add-hook 'magit-pre-refresh-hook #'diff-hl-magit-pre-refresh)
        (add-hook 'magit-post-refresh-hook #'diff-hl-magit-post-refresh))))

#+end_src

** Highlight some operations

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  (use-package volatile-highlights
    :diminish
    :hook (after-init . volatile-highlights-mode)
    :config
    (with-no-warnings
      (when (fboundp 'pulse-momentary-highlight-region)
        (defun my/vhl-pulse (beg end &optional _buf face)
          "Pulse the changes."
          (pulse-momentary-highlight-region beg end face))
        (advice-add #'vhl/.make-hl :override #'my/vhl-pulse))))

#+end_src

** Pulse current line

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  (use-package pulse
    :ensure nil
    :custom-face
    (pulse-highlight-start-face ((t (:inherit region))))
    (pulse-highlight-face ((t (:inherit region))))
    :hook (((dumb-jump-after-jump
             imenu-after-jump)     . my/recenter-and-pulse)
           ((bookmark-after-jump
             magit-diff-visit-file
             next-error)           . my/recenter-and-pulse-line))
    :init
    (with-no-warnings
      (defun my/pulse-momentary-line (&rest _)
        "Pulse the current line."
        (pulse-momentary-highlight-one-line (point)))

      (defun my/pulse-momentary (&rest _)
        "Pulse the region or the current line."
        (if (fboundp 'xref-pulse-momentarily)
            (xref-pulse-momentarily)
          (my/pulse-momentary-line)))

      (defun my/recenter-and-pulse(&rest _)
        "Recenter and pulse the region or the current line."
        (recenter)
        (my/pulse-momentary))

      (defun my/recenter-and-pulse-line (&rest _)
        "Recenter and pulse the current line."
        (recenter)
        (my/pulse-momentary-line))

      (dolist (cmd '(recenter-top-bottom
                     other-window windmove-do-window-select
                     ace-window aw--select-window
                     pager-page-down pager-page-up
                     treemacs-select-window
                     symbol-overlay-basic-jump))
        (advice-add cmd :after #'my/pulse-momentary-line))

      (dolist (cmd '(pop-to-mark-command
                     pop-global-mark
                     goto-last-change))
        (advice-add cmd :after #'my/recenter-and-pulse))))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-highlight.el

  (provide 'init-highlight)

#+end_src

* Ibuffer

IBuffer configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-ibuffer.el

  ;; -*- lexical-binding: t -*-

  (require 'init-funcs)
  (require 'init-treemacs)

#+end_src

** ibuffer

#+begin_src emacs-lisp :tangle ./lisp/init-ibuffer.el

  (use-package ibuffer
    :after evil avy
    :ensure nil
    :bind (:map ibuffer-mode-map
           ("j" . evil-next-line)
           ("k" . evil-previous-line)
           ("h" . evil-backward-char)
           ("l" . evil-forward-char)
           ("/" . avy-goto-char-timer))
    :init (setq ibuffer-filter-group-name-face '(:inherit (font-lock-string-face bold)))
    :config
    ;; Display icons for buffers
    (use-package all-the-icons-ibuffer
      :if (icons-displayable-p)
      :init (all-the-icons-ibuffer-mode 1))

    (with-eval-after-load 'counsel
      (with-no-warnings
        (defun my/ibuffer-find-file ()
          (interactive)
          (let ((default-directory (let ((buf (ibuffer-current-buffer)))
                                     (if (buffer-live-p buf)
                                         (with-current-buffer buf
                                           default-directory)
                                       default-directory))))
            (counsel-find-file default-directory)))
        (advice-add #'ibuffer-find-file :override #'my/ibuffer-find-file))))

#+end_src

** ibuffer-projectile

Group ibuffer's list by project root

#+begin_src emacs-lisp :tangle ./lisp/init-ibuffer.el

  (use-package ibuffer-projectile
    :functions all-the-icons-octicon ibuffer-do-sort-by-alphabetic
    :hook ((ibuffer . (lambda ()
                        (ibuffer-projectile-set-filter-groups)
                        (unless (eq ibuffer-sorting-mode 'alphabetic)
                          (ibuffer-do-sort-by-alphabetic)))))
    :config
    (setq ibuffer-projectile-prefix
          (if (icons-displayable-p)
              (concat
               (all-the-icons-octicon "file-directory"
                                      :face ibuffer-filter-group-name-face
                                      :v-adjust 0.0
                                      :height 1.0)
               " ")
            "Project: ")))

#+end_src

** Keybinding

#+begin_src emacs-lisp :tangle ./lisp/init-ibuffer.el

  (leader-key-def
    "l" (lambda ()
          (interactive)
          (if (equal major-mode 'treemacs-mode)
              (treemacs-visit-node-ace-horizontal-split)
            (progn
              (split-window-horizontally)
              (other-window 1)
              (ibuffer))))
    "j" (lambda ()
          (interactive)
          (if (equal major-mode 'treemacs-mode)
              (treemacs-visit-node-ace-vertical-split)
            (progn
              (split-window-vertically)
              (other-window 1)
              (ibuffer)))))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-ibuffer.el
	
  (provide 'init-ibuffer)

#+end_src

* Ivy

Ivy configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-ivy.el

  ;; -*- lexical-binding: t -*-

  (require 'init-custom)
  (require 'init-funcs)
  (require 'init-evil)

#+end_src

