emacs.d.org
** swiper

#+begin_src emacs-lisp :tangle ./lisp/init-ivy.el

  (use-package swiper
    :after evil
    :bind (:map evil-normal-state-map
                ("?"   . swiper)))

#+end_src

** all-the-icons-ivy-rich

Better experience with icons
Enable it before`ivy-rich-mode' for better performance

#+begin_src emacs-lisp :tangle ./lisp/init-ivy.el

  (use-package all-the-icons-ivy-rich
    :if (icons-displayable-p)
    :hook (ivy-mode . all-the-icons-ivy-rich-mode))

#+end_src

** ivy-rich

More friendly display transformer for Ivy

#+begin_src emacs-lisp :tangle ./lisp/init-ivy.el

  (use-package ivy-rich
    :hook (;; Must load after `counsel-projectile'
           (counsel-projectile-mode . ivy-rich-mode)
           (ivy-rich-mode . (lambda ()
                              "Use abbreviate in `ivy-rich-mode'."
                              (setq ivy-virtual-abbreviate
                                    (or (and ivy-rich-mode 'abbreviate) 'name)))))
    :init
    ;; For better performance
    (setq ivy-rich-parse-remote-buffer nil))
	
#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-ivy.el

  (provide 'init-ivy)
	
#+end_src

* Org mode

Org configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-org.el

  ;; -*- lexical-binding: t -*-

  (require 'init-evil)
  (require 'init-basic)

#+end_src

** General configuration

#+begin_src emacs-lisp :tangle ./lisp/init-org.el

  (use-package org
    :defer t
    :after yasnippet
    :hook (org-mode . (lambda ()
                        (turn-on-auto-fill)
                        (variable-pitch-mode 1)
                        (visual-line-mode t)
                        (diff-hl-mode 0)))
    :bind (:map org-mode-map
                ("M-k" . org-metaup)
                ("M-j" . org-metadown))
    :config
    (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
    (setq org-ellipsis                      " ▾ "
          org-src-fontify-natively          t
          org-src-tab-acts-natively         t
          org-edit-src-content-indentation  2
          org-hide-block-startup            nil
          org-src-preserve-indentation      nil
          org-cycle-separator-lines         2
          org-startup-folded                'all
          org-src-window-setup              'current-window
          org-edit-src-persistent-message   nil
          org-return-follows-link           t
          org-startup-indented              t)

    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    (use-package org-bullets
      :hook (org-mode . org-bullets-mode)
      :custom
      (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.15)
                    (org-level-3 . 1.10)
                    (org-level-4 . 1.05)
                    (org-level-5 . 1.0)
                    (org-level-6 . 1.0)
                    (org-level-7 . 1.0)
                    (org-level-8 . 1.0)))
      (set-face-attribute (car face) nil :font "SauceCodePro Nerd Font" :weight 'regular :height (cdr face)))

    ;; set local scroll-margin
    (add-hook 'org-mode-hook (lambda ()
                               (set (make-variable-buffer-local 'scroll-margin) 0)))

    (use-package visual-fill-column
      :hook (org-mode . visual-fill-column-mode)
      :config
      (setq-default visual-fill-column-width       110
                    visual-fill-column-center-text t))

#+end_src

** LaTeX

#+begin_src emacs-lisp :tangle ./lisp/init-org.el

  (setq org-latex-toc-command    "\\tableofcontents \\clearpage"
        org-format-latex-options (plist-put org-format-latex-options :scale 1.6))

  ;; (setq org-latex-create-formula-image-program 'imagemagick)

  (with-eval-after-load 'ox-latex
    (add-to-list 'org-latex-classes
                 '("org-plain-latex"
                   "\\documentclass{article}
                    [NO-DEFAULT-PACKAGES]
                    [PACKAGES]
                    [EXTRA]"
                   ("\\part{%s}"          . "\\part*{%s}")
                   ("\\section{%s}"       . "\\section*{%s}")
                   ("\\subsection{%s}"    . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}"     . "\\paragraph*{%s}"))))

  (use-package org-fragtog
    :hook (org-mode . org-fragtog-mode)
    :config
    (setq org-fragtog-preview-delay 0.25))

  (defun my/update-theorem-and-lemma-counts ()
    (interactive)
    (setq latex-theorem-count 1
          latex-lemma-count   1)
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward "\\\\begin{theorem}" nil t)
        (setq latex-theorem-count (1+ latex-theorem-count)))
      (goto-char (point-min))
      (while (re-search-forward "\\\\begin{lemma}" nil t)
        (setq latex-lemma-count (1+ latex-lemma-count)))))

  (defun my/inkscape-figures-create ()
    (interactive)
    (setq img-file-path (shell-command-to-string "inkscape-figures create"))
    (if (not (equal img-file-path ""))
        (progn
          (insert img-file-path)
          (if (not (equal org-inline-image-overlays nil))
              (org-toggle-inline-images))
          (org-toggle-inline-images))
      (progn
        (evil-previous-line)
        (kill-whole-line 2))))

  (defun my/insert-image ()
    (interactive)
    (setq old-default-directory default-directory
          default-directory     "~/Pictures/screenshots/"
          selected-file         (ivy-read "Choose file: " #'read-file-name-internal))
    (setq default-directory     old-default-directory
          img-file-path         (shell-command-to-string (concat "inkscape-figures move " selected-file)))
    (insert (concat "[[" img-file-path "]]"))
    (if (not (equal org-inline-image-overlays nil))
        (org-toggle-inline-images))
    (org-toggle-inline-images)
    )

  (defun my/inkscape-figures-edit (line-str)
    (interactive)
    (setq file-name (replace-regexp-in-string "\\[\\|\\]" "" line-str))
    (shell-command-to-string (concat "inkscape-figures edit " file-name))
    (org-toggle-inline-images)
    (org-toggle-inline-images))

  (defun my/change-environment ()
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (if (save-excursion (re-search-forward "align" nil t))
          (replace-regexp "align" "gather")
        (replace-regexp "gather" "align"))))

  (add-to-list 'display-buffer-alist '("*Async Shell Command*" display-buffer-no-window (nil)))

  (defun my/org-latex-export ()
    (interactive)
    (setq tex-file-name (org-latex-export-to-latex))
    (shell-command-to-string (concat
                              "sed -i -e '/\\\\begin{latex}/d; /\\\\end{latex}/d' ./" tex-file-name ";"
                              "sed -i 's/^\\\\begin{theorem}/\\\\begin{boxtheorem}/' ./" tex-file-name ";"
                              "sed -i 's/^\\\\end{theorem}/\\\\end{boxtheorem}/' ./" tex-file-name ";"
                              "sed -i 's/^\\\\begin{lemma}/\\\\begin{boxlemma}/' ./" tex-file-name ";"
                              "sed -i 's/^\\\\end{lemma}/\\\\end{boxlemma}/' ./" tex-file-name))
    (setq pdf-file-name (org-latex-compile tex-file-name))
    (async-shell-command (concat "zathura " pdf-file-name) nil nil))

  (defun my/org-latex-mode ()
    (interactive)
    (setq org-src-window-setup      'split-window-below
          my/enable-refresh-markers t)
    (aas-activate-for-major-mode)
    (my/update-theorem-and-lemma-counts)
    (my/org-load-prettify-symbols))

#+end_src

** Keybindings

#+begin_src emacs-lisp :tangle ./lisp/init-org.el

  (setq org-jump-to-previous-block nil
        org-latex-mode             nil)

  (defun my/isearch-line-forward (regexp-p)
    (catch 'my-catch
      (narrow-to-region (line-beginning-position) (line-end-position))
      (if (search-forward regexp-p nil t nil)
          (progn
            (widen)
            (throw 'my-catch t)))
      (widen)))

  (defun my/just-one-space ()
    (insert "x")
    (if (my/isearch-line-forward "\\(")
        (progn
          (evil-backward-char 2)
          (delete-horizontal-space)))
    (backward-delete-char 1))

  (defun my/org-edit-special ()
    (interactive)
    (setq line-str           (buffer-substring (line-beginning-position) (line-end-position))
          processed-line-str (replace-regexp-in-string "\\[\\[[[:word:]\\|\\.\\|/]*\\]\\]" "" line-str)
          current-layout     (shell-command-to-string "xkb-switch -p"))
    (shell-command-to-string "xdotool key Mode_switch")
    (if (and (equal processed-line-str "")
             (not (equal line-str "")))
        (my/inkscape-figures-edit line-str)
      (progn
        (org-edit-special)
        (setq-local org-latex-mode t)
        (if (equal current-layout "ru\n")
            (setq change-lang t)
          (setq change-lang nil)))))

  (defun my/org-edit-src-exit ()
    (interactive)
    (yas-exit-all-snippets)
    (if (equal (count-lines (point-min) (point-max)) 1)
        (setq latex-fragment t)
      (setq latex-fragment nil))
    (org-edit-src-exit)
    (cond (change-lang                (shell-command-to-string "xkb-switch -n")))
    (cond (org-jump-to-previous-block (org-previous-block 1))
          (latex-fragment             (progn
                                        (if (org-in-item-p) (my/just-one-space))
                                        (my/isearch-line-forward "\\)")
                                        (org-latex-preview)))))

  (evil-define-key '(normal insert visual) org-mode-map (kbd "C-k") 'evil-window-up)
  (evil-define-key '(normal insert visual) org-mode-map (kbd "C-j") 'evil-window-down)
  (evil-define-key '(normal visual)        org-mode-map (kbd "J")   'org-next-visible-heading)
  (evil-define-key '(normal visual)        org-mode-map (kbd "K")   'org-previous-visible-heading)
  (evil-define-key '(insert)               org-mode-map (kbd "C-i") 'org-insert-item)

  (leader-key-def
    "bt" 'org-babel-tangle
    "i"  'my/org-edit-special
    "q"  (lambda ()
           (interactive)
           (cond (org-latex-mode (my/org-edit-src-exit))
                 (t              (evil-quit))))
    "op" 'org-latex-preview
    "el" 'my/org-latex-export
    "ce" 'my/change-environment
    "rc" 'my/update-theorem-and-lemma-counts)

#+end_src

** Auto tangle

#+begin_src emacs-lisp :tangle ./lisp/init-org.el

  (setq org-babel-tangle-async-mode nil)

  (defun my/org-babel-tangle-async (file)
    "Invoke `org-babel-tangle-file' asynchronously."
    (message "Tangling %s..." (buffer-file-name))
    (async-start
     (let ((args (list file)))
       `(lambda ()
          (require 'org)
          (let ((start-time (current-time)))
            (apply #'org-babel-tangle-file ',args)
            (format "%.2f" (float-time (time-since start-time))))))
     (let ((message-string (format "Tangling %S completed after " file)))
       `(lambda (tangle-time)
          (message (concat ,message-string
                           (format "%s seconds" tangle-time)))))))

  (defun my/org-babel-tangle-current-buffer-async ()
    "Tangle current buffer asynchronously."
    (interactive)
    (if org-babel-tangle-async-mode
        (my/org-babel-tangle-async (buffer-file-name))))

  (add-hook 'org-mode-hook (lambda ()
                             (add-hook 'after-save-hook #'my/org-babel-tangle-current-buffer-async
                                       'run-at-end 'only-in-org-mode)))

#+end_src

** Org config mode

#+begin_src emacs-lisp :tangle ./lisp/init-org.el

  (defun my/org-config-mode ()
    (interactive)
    (setq org-babel-tangle-async-mode       t
          org-jump-to-previous-block        t
          org-edit-src-auto-save-idle-delay 1))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-org.el

  )
	
  (provide 'init-org)

#+end_src

* Tex
** Header

#+begin_src emacs-lisp :tangle ./lisp/init-tex.el

  ;; -*- lexical-binding: t -*-
	
#+end_src

** pdf-tools

#+begin_src emacs-lisp :tangle ./lisp/init-tex.el

  (use-package pdf-tools
    :mode (("\\.pdf\\'" . pdf-view-mode))
    :bind (:map pdf-view-mode-map
                ;; ("SPC" . nil)
                ;; ("SPC h v" . 'counsel-describe-variable-function)
                ("j"       . pdf-view-next-line-or-next-page)
                ("k"       . pdf-view-previous-line-or-previous-page)
                ("J"       . pdf-view-next-page)
                ("K"       . pdf-view-previous-page)
                )
    :hook (pdf-view-mode . solaire-mode)
    :config
    (pdf-tools-install :no-query)

    (pdf-view-themed-minor-mode)

    ;; (setq-default pdf-view-display-size 'fit-page)
    (setq pdf-view-resize-factor 1.1))

#+end_src

** Auctex

#+begin_src emacs-lisp :tangle ./lisp/init-tex.el

  (use-package auctex
    :hook ((LaTeX-mode . display-line-numbers-mode)
           (LaTeX-mode . TeX-fold-mode)
           (LaTeX-mode . turn-on-auto-fill)
           (LaTeX-mode . (lambda ()
                           (interactive)
                           (define-key LaTeX-mode-map "\C-j" 'nil)
                           (add-hook 'find-file-hook 'TeX-fold-buffer t)
                           (electric-pair-local-mode -1)
                           (company-mode -1)
                           (my/latex-load-prettify-symbols))))
    :custom
    (TeX-auto-save                     t)
    (TeX-parse-self                    t)
    (TeX-PDF-mode                      t)
    (TeX-file-line-error               t)
    (TeX-fold-auto                     t)
    (TeX-source-correlate-start-server t)
    (TeX-view-program-selection        '((output-pdf "pdf-tools"))
                                       TeX-source-correlate-start-server t)
    (TeX-view-program-list             '(("pdf-tools" "TeX-pdf-tools-sync-view")))
    (preview-auto-cache-preamble       t)
    :config
    (setq-default TeX-master nil)

    (bind-key "SPC p d" #'preview-document LaTeX-mode-map))

#+end_src

** evil-tex

#+begin_src emacs-lisp :tangle ./lisp/init-tex.el

  ;; (use-package evil-tex
  ;;   :hook (LaTeX-mode . evil-tex-mode))

#+end_src

