emacs.d.org
** cdlatex

#+begin_src emacs-lisp :tangle ./lisp/init-tex.el

  (use-package cdlatex
    :after yasnippet
    :hook ((LaTeX-mode  . turn-on-cdlatex)
           (cdlatex-tab . my/cdlatex-in-yas-field))
    :bind (:map cdlatex-mode-map
                ("<"     . nil)
                ("("     . nil)
                ("["     . nil)
                ("{"     . nil)
                ("|"     . nil)
                ("_"     . nil))
    :config
    (defun my/cdlatex-in-yas-field ()
      ;; Check if we're at the end of the Yas field
      (when-let* ((_ (overlayp yas--active-field-overlay))
                  (end (overlay-end yas--active-field-overlay)))
        (if (>= (point) end)
            ;; Call yas-next-field if cdlatex can't expand here
            (let ((s (thing-at-point 'sexp)))
              (unless (and s (assoc (substring-no-properties s)
                                    cdlatex-command-alist-comb))
                (yas-next-field-or-maybe-expand)
                t))
          ;; otherwise expand and jump to the correct location
          (let (cdlatex-tab-hook minp)
            (setq minp
                  (min (save-excursion (cdlatex-tab)
                                       (point))
                       (overlay-end yas--active-field-overlay)))
            (goto-char minp) t)))))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-tex.el

  (provide 'init-tex)

#+end_src

* Package

Emacs Package management configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-package.el

  ;; -*- lexical-binding: t -*-

  (require 'init-custom)
  (require 'init-funcs)
	
#+end_src

** Save selected packages

#+begin_src emacs-lisp :tangle ./lisp/init-package.el

  ;; HACK: DO NOT copy package-selected-packages to init/custom file forcibly.
  ;; https://github.com/jwiegley/use-package/issues/383#issuecomment-247801751
  (defun my/save-selected-packages (&optional value)
    "Set `package-selected-packages' to VALUE but don't save to `custom-file'."
    (when value
      (setq package-selected-packages value)))
  (advice-add 'package--save-selected-packages :override #'my/save-selected-packages)
	
#+end_src

** Set ELPA packages

#+begin_src emacs-lisp :tangle ./lisp/init-package.el

  (set-package-archives centaur-package-archives nil nil t)
	
#+end_src

** Initialize packages

#+begin_src emacs-lisp :tangle ./lisp/init-package.el

  (unless (bound-and-true-p package--initialized) ; To avoid warnings in 27
    (setq package-enable-at-startup nil)          ; To prevent initializing twice
    (package-initialize))
	
#+end_src

** use-pakcage

#+begin_src emacs-lisp :tangle ./lisp/init-package.el

  ;; Setup `use-package'
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  ;; Should set before loading `use-package'
  (eval-and-compile
    (setq use-package-always-ensure        t)
    (setq use-package-always-defer         t)
    (setq use-package-expand-minimally     t)
    (setq use-package-enable-imenu-support t))

  (eval-when-compile
    (require 'use-package))

  ;; Required by `use-package'
  (use-package diminish)
  (use-package bind-key)

#+end_src

** Update GPG keyring for GNU ELPA

#+begin_src emacs-lisp :tangle ./lisp/init-package.el

  (use-package gnu-elpa-keyring-update)
	
#+end_src

** Auto update packages

#+begin_src emacs-lisp :tangle ./lisp/init-package.el

  (use-package auto-package-update
    :init
    (setq auto-package-update-delete-old-versions t
          auto-package-update-hide-results t)
    (defalias 'upgrade-packages #'auto-package-update-now))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-package.el
	
  (provide 'init-package)

#+end_src

* Prog

General programming configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-prog.el

  ;; -*- lexical-binding: t -*-
	
  (require 'init-custom)

#+end_src

** dump-mode

Jump to definition

#+begin_src emacs-lisp :tangle ./lisp/init-prog.el

  (use-package dumb-jump
    :bind (("M-g o" . dumb-jump-go-other-window)
           ("M-g j" . dumb-jump-go)
           ("M-g i" . dumb-jump-go-prompt)
           ("M-g x" . dumb-jump-go-prefer-external)
           ("M-g z" . dumb-jump-go-prefer-external-other-window)
           ("C-M-j" . dumb-jump-hydra/body))
    :init
    (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
    (setq dumb-jump-prefer-searcher 'rg
          dumb-jump-selector        'ivy))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-prog.el

  (provide 'init-prog)
	
#+end_src

* Projectile

Projectile configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-projectile.el

  ;; -*- lexical-binding: t -*-
	
#+end_src

** projectile

Manage and navigate projects

#+begin_src emacs-lisp :tangle ./lisp/init-projectile.el

  (use-package projectile
    :diminish
    :bind (:map projectile-mode-map
           ("s-t"   . projectile-find-file) ; `cmd-t' or `super-t'
           ("C-c p" . projectile-command-map))
    :hook (after-init . projectile-mode)
    :init
    (setq projectile-mode-line-prefix ""
          projectile-sort-order       'recentf
          projectile-use-git-grep     t)
    :config
    ;; (projectile-update-mode-line)         ; Update mode-line at the first time

    ;; Use the faster searcher to handle project files: ripgrep `rg'.
    (when (and (not (executable-find "fd"))
               (executable-find "rg"))
      (setq projectile-generic-command
            (let ((rg-cmd ""))
              (dolist (dir projectile-globally-ignored-directories)
                (setq rg-cmd (format "%s --glob '!%s'" rg-cmd dir)))
              (concat "rg -0 --files --color=never --hidden" rg-cmd))))

    ;; Support Perforce project
    (let ((val (or (getenv "P4CONFIG") ".p4config")))
      (add-to-list 'projectile-project-root-files-bottom-up val)))


#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-projectile.el

  (provide 'init-projectile)
	
#+end_src

* Treemacs

Treemacs: A tree layout file explorer.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-treemacs.el

  ;; -*- lexical-binding: t -*-

  (require 'init-custom)
  (require 'init-evil)
  (require 'init-vcs)

#+end_src

** treemacs

#+begin_src emacs-lisp :tangle ./lisp/init-treemacs.el

  (defun my/treemacs-select-window ()
    (interactive)
    (if (equal major-mode 'treemacs-mode)
        (treemacs)
      (treemacs-select-window)))

  (use-package treemacs
    :after evil
    :commands (treemacs-follow-mode
               treemacs-filewatch-mode
               treemacs-git-mode)
    :bind (:map treemacs-mode-map
           ("d"   . treemacs-delete)
           ("r"   . treemacs-rename)
           ("C-n" . treemacs)
           ("C-/" . treemacs-helpful-hydra)
           ("C-j" . evil-window-down)
           :map evil-normal-state-map
           ("C-n" . my/treemacs-select-window)
           :map evil-visual-state-map
           ("C-n" . my/treemacs-select-window)
           :map evil-insert-state-map
           ("C-n" . my/treemacs-select-window))
    :custom-face (treemacs-git-modified-face ((t (:foreground "#51afef"))))
    :config
    (setq treemacs-collapse-dirs     0
          treemacs-sorting           'alphabetic-asc
          treemacs-follow-after-init t
          treemacs-width             30
          treemacs-file-event-delay  500
          treemacs-no-png-images     (not centaur-icon))
    :config
    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-git-mode 'deferred)

    (add-hook 'treemacs-mode-hook (lambda ()
                                    (set (make-variable-buffer-local 'scroll-margin) 0))))

#+end_src

** treemacs-evil

#+begin_src emacs-lisp :tangle ./lisp/init-treemacs.el

  (use-package treemacs-evil
    :after treemacs evil)

#+end_src

** treemacs-projectile

#+begin_src emacs-lisp :tangle ./lisp/init-treemacs.el

  (use-package treemacs-projectile
    :after treemacs projectile
    :bind (:map projectile-command-map
           ("h" . treemacs-projectile)))

#+end_src

** treemacs-magit

#+begin_src emacs-lisp :tangle ./lisp/init-treemacs.el

  (use-package treemacs-magit
    :after treemacs magit
    :commands treemacs-magit--schedule-update
    :hook ((magit-post-commit
            git-commit-post-finish
            magit-post-stage
            magit-post-unstage)
           . treemacs-magit--schedule-update))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-treemacs.el
	
  (provide 'init-treemacs)

#+end_src

* UI

Visual (UI) configurations for better lookings and appearances.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  ;; -*- lexical-binding: t -*-

  (require 'init-custom)
  (require 'init-funcs)

#+end_src

** Optimization

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (setq idle-update-delay 1.0)

  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)

  (setq fast-but-imprecise-scrolling t)
  (setq redisplay-skip-fontification-on-input t)

#+end_src

** Inhibit resizing frame

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (setq frame-inhibit-implied-resize t
        frame-resize-pixelwise       t)

#+end_src

** Theme

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  ;; Make certain buffers grossly incandescent
  ;; Must before loading the theme
  (use-package solaire-mode
    :hook (((change-major-mode
             after-revert
             ediff-prepare-buffer) . turn-on-solaire-mode)
           (minibuffer-setup       . solaire-mode-fix-minibuffer))
    :init
    (solaire-global-mode 1))

  (use-package doom-themes
    :custom-face (doom-modeline-buffer-file ((t (:inherit (mode-line bold)))))
    :custom (doom-themes-treemacs-theme "doom-colors")
    :init
    (load-theme 'doom-one t)
    :config
    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable customized theme
    (doom-themes-treemacs-config))

#+end_src

** Mode-line
*** doom-modeline

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (use-package doom-modeline
    :custom
    (doom-modeline-icon             t)
    (doom-modeline-minor-modes      t)
    (doom-modeline-unicode-fallback t)
    (doom-modeline-mu4e             nil)
    (doom-modeline-height           34)
    :hook (after-init . doom-modeline-mode)
    :init
    ;; Prevent flash of unstyled modeline at startup
    (unless after-init-time
      (setq doom-modeline--default-format mode-line-format)
      (setq-default mode-line-format nil)))

#+end_src

*** hide-mode-line

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (use-package hide-mode-line
    :hook (((completion-list-mode
             completion-in-region-mode
             flycheck-error-list-mode) . hide-mode-line-mode)))
	
#+end_src

*** minions

A minor-mode menu for mode-line

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (use-package minions
    :hook (doom-modeline-mode . minions-mode))

#+end_src

** Icons

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (use-package all-the-icons
    :if (display-graphic-p)
    :init (unless (find-font (font-spec :name "all-the-icons"))
            (all-the-icons-install-fonts t)))

#+end_src

** Line numbers

Show native line numbers

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (use-package display-line-numbers
    :ensure nil
    :hook (prog-mode . display-line-numbers-mode))
	
#+end_src

** Suppress GUI features

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (setq use-file-dialog                   nil
        use-dialog-box                    nil
        inhibit-startup-screen            t
        inhibit-startup-echo-area-message t)

#+end_src

** Display dividers between windows

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (setq window-divider-default-places       t
        window-divider-default-bottom-width 1
        window-divider-default-right-width  1)

  (add-hook 'window-setup-hook #'window-divider-mode)

#+end_src

** text-scale

Easily adjust the font size

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (global-set-key (kbd "C-=") 'text-scale-increase)
  (global-set-key (kbd "C--") 'text-scale-decrease)
  (global-set-key (kbd "C-0") (lambda () (text-scale-mode 0)))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-ui.el

  (provide 'init-ui)
	
#+end_src

* Utils

Some usefule Utilities.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-utils.el

  ;; -*- lexical-binding: t -*-
	
#+end_src

** which-key

Display available keybindings in popup

#+begin_src emacs-lisp :tangle ./lisp/init-utils.el

  (use-package which-key
    :diminish
    :hook (after-init . which-key-mode)
    :init (setq which-key-max-description-length 30
                which-key-show-remaining-keys t))

#+end_src

** Search tools

#+begin_src emacs-lisp :tangle ./lisp/init-utils.el

  ;; ;; Writable `grep' buffer
  ;; (use-package wgrep
  ;;   :init
  ;;   (setq wgrep-auto-save-buffer t
  ;;         wgrep-change-readonly-file t))

  ;; ;; Fast search tool `ripgrep'
  ;; (use-package rg
  ;;   :defines projectile-command-map
  ;;   :hook (after-init . rg-enable-default-bindings)
  ;;   :bind (:map rg-global-map
  ;;          ("c" . rg-dwim-current-dir)
  ;;          ("f" . rg-dwim-current-file)
  ;;          ("m" . rg-menu)
  ;;          :map rg-mode-map
  ;;          ("m" . rg-menu))
  ;;   :init (setq rg-group-result t
  ;;               rg-show-columns t)
  ;;   :config
  ;;   (cl-pushnew '("tmpl" . "*.tmpl") rg-custom-type-aliases)

  ;;   (with-eval-after-load 'projectile
  ;;     (defalias 'projectile-ripgrep #'rg-project)
  ;;     (bind-key "s R" #'rg-project projectile-command-map))

  ;;   (with-eval-after-load 'counsel
  ;;     (bind-keys
  ;;      :map rg-global-map
  ;;      ("R" . counsel-rg)
  ;;      ("F" . counsel-fzf))))

#+end_src

** real-auto-save

#+begin_src emacs-lisp :tangle ./lisp/init-utils.el

  (use-package real-auto-save
    :hook (find-file . real-auto-save-mode)
    :config
    (setq real-auto-save-interval 1))

#+end_src

** Process

#+begin_src emacs-lisp :tangle ./lisp/init-utils.el

  ;; (use-package proced
  ;;   :ensure nil
  ;;   :init
  ;;   (setq-default proced-format 'verbose)
  ;;   (setq proced-auto-update-flag t
  ;;         proced-auto-update-interval 3))

#+end_src

