emacs.d.org
** Misc

#+begin_src emacs-lisp :tangle ./lisp/init-utils.el

  (use-package copyit)                    ; copy path, url, etc.
  (use-package esup)                      ; Emacs startup profiler
  (use-package list-environment)
  (use-package memory-usage)
  (use-package daemons)                   ; system services/daemons
  (use-package command-log-mode)

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-utils.el

  (provide 'init-utils)
	
#+end_src

* VCS

Version control systems.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-vcs.el

  ;; -*- lexical-binding: t -*-

#+end_src

** magit

#+begin_src emacs-lisp :tangle ./lisp/init-vcs.el

  (use-package magit
    :bind (:map magit-status-mode-map
                ("j" . evil-next-line)
                ("k" . evil-previous-line))
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (leader-key-def
    "g"  'magit-status
    "ef" 'with-editor-finish)

#+end_src

** magit-todos

Show TODOs in magit

#+begin_src emacs-lisp :tangle ./lisp/init-vcs.el

  (use-package magit-todos
    :after magit
    :init
    (setq magit-todos-nice (if (executable-find "nice") t nil))
    (magit-todos-mode 1))

#+end_src

** git-timemachine

Walk through git revisions of a file

#+begin_src emacs-lisp :tangle ./lisp/init-vcs.el

  (use-package git-timemachine
    :custom-face
    (git-timemachine-minibuffer-author-face ((t (:inherit success))))
    (git-timemachine-minibuffer-detail-face ((t (:inherit warning))))
    :bind (:map vc-prefix-map
           ("t" . git-timemachine))
    :hook (before-revert . (lambda ()
                             (when (bound-and-true-p git-timemachine-mode)
                               (user-error "Cannot revert the timemachine buffer")))))
	
#+end_src

** Git related modes

#+begin_src emacs-lisp :tangle ./lisp/init-vcs.el

  ;; (use-package gitattributes-mode)
  ;; (use-package gitconfig-mode)
  ;; (use-package gitignore-mode)

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-vcs.el

  (provide 'init-vcs)
	
#+end_src

* Window

Window configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-window.el

  ;; -*- lexical-binding: t -*-

#+end_src

** windmove

Directional window-selection routines

#+begin_src emacs-lisp :tangle ./lisp/init-window.el

  (use-package windmove
    :ensure nil
    :hook (after-init . windmove-default-keybindings))

#+end_src

** winner

Restore old window configurations

#+begin_src emacs-lisp :tangle ./lisp/init-window.el

  (use-package winner
    :ensure nil
    :commands (winner-undo winner-redo)
    :hook (after-init . winner-mode)
    :init (setq winner-boring-buffers '("*Completions*"
                                        "*Compile-Log*"
                                        "*inferior-lisp*"
                                        "*Fuzzy Completions*"
                                        "*Apropos*"
                                        "*Help*"
                                        "*cvs*"
                                        "*Buffer List*"
                                        "*Ibuffer*"
                                        "*esh command on file*")))
	
#+end_src

** ace-window

Quickly switch windows

#+begin_src emacs-lisp :tangle ./lisp/init-window.el

  (use-package ace-window
    :custom-face
    ;; (aw-leading-char-face ((t (:inherit font-lock-keyword-face :bold t :height 3.0))))
    ;; (aw-minibuffer-leading-char-face ((t (:inherit font-lock-keyword-face :bold t :height 2.0))))
    ;; (aw-mode-line-face ((t (:inherit mode-line-emphasis :bold t))))
    :bind (([remap other-window] . ace-window)
           ("C-c w" . ace-window-hydra/body))
    :hook (emacs-startup . ace-window-display-mode)
    :config
    (defun toggle-window-split ()
      (interactive)
      (if (= (count-windows) 2)
          (let* ((this-win-buffer (window-buffer))
                 (next-win-buffer (window-buffer (next-window)))
                 (this-win-edges (window-edges (selected-window)))
                 (next-win-edges (window-edges (next-window)))
                 (this-win-2nd (not (and (<= (car this-win-edges)
                                             (car next-win-edges))
                                         (<= (cadr this-win-edges)
                                             (cadr next-win-edges)))))
                 (splitter
                  (if (= (car this-win-edges)
                         (car (window-edges (next-window))))
                      'split-window-horizontally
                    'split-window-vertically)))
            (delete-other-windows)
            (let ((first-win (selected-window)))
              (funcall splitter)
              (if this-win-2nd (other-window 1))
              (set-window-buffer (selected-window) this-win-buffer)
              (set-window-buffer (next-window) next-win-buffer)
              (select-window first-win)
              (if this-win-2nd (other-window 1))))
        (user-error "`toggle-window-split' only supports two windows")))

    ;; Bind hydra to dispatch list
    (add-to-list 'aw-dispatch-alist '(?w ace-window-hydra/body) t)

    ;; Select widnow via `M-1'...`M-9'
    (defun aw--select-window (number)
      "Slecet the specified window."
      (when (numberp number)
        (let ((found nil))
          (dolist (win (aw-window-list))
            (when (and (window-live-p win)
                       (eq number (string-to-number (window-parameter win 'ace-window-path))))
              (setq found t)
              (aw-switch-to-window win)))
          (unless found
            (message "No specified window: %d" number)))))
    (dotimes (n 9)
      (bind-key (format "M-%d" (1+ n))
                (lambda ()
                  (interactive)
                  (aw--select-window (1+ n))))))

#+end_src

** shackle

Enforce rules for popups

#+begin_src emacs-lisp :tangle ./lisp/init-window.el

  (use-package shackle
    :functions org-switch-to-buffer-other-window
    :commands shackle-display-buffer
    :hook (after-init . shackle-mode)
    :config
    (with-no-warnings
      (defvar shackle--popup-window-list nil) ; all popup windows
      (defvar-local shackle--current-popup-window nil) ; current popup window
      (put 'shackle--current-popup-window 'permanent-local t)

      (defun shackle-last-popup-buffer ()
        "View last popup buffer."
        (interactive)
        (ignore-errors
          (display-buffer shackle-last-buffer)))
      ;; (bind-key "C-h z" #'shackle-last-popup-buffer)

      ;; Add keyword: `autoclose'
      (defun shackle-display-buffer-hack (fn buffer alist plist)
        (let ((window (funcall fn buffer alist plist)))
          (setq shackle--current-popup-window window)

          (when (plist-get plist :autoclose)
            (push (cons window buffer) shackle--popup-window-list))
          window))

      (defun shackle-close-popup-window-hack (&rest _)
        "Close current popup window via `C-g'."
        (setq shackle--popup-window-list
              (cl-loop for (window . buffer) in shackle--popup-window-list
                       if (and (window-live-p window)
                               (equal (window-buffer window) buffer))
                       collect (cons window buffer)))
        ;; `C-g' can deactivate region
        (when (and (called-interactively-p 'interactive)
                   (not (region-active-p)))
          (let (window buffer)
            (if (one-window-p)
                (progn
                  (setq window (selected-window))
                  (when (equal (buffer-local-value 'shackle--current-popup-window
                                                   (window-buffer window))
                               window)
                    (winner-undo)))
              (setq window (caar shackle--popup-window-list))
              (setq buffer (cdar shackle--popup-window-list))
              (when (and (window-live-p window)
                         (equal (window-buffer window) buffer))
                (delete-window window)

                (pop shackle--popup-window-list))))))

      (advice-add #'keyboard-quit :before #'shackle-close-popup-window-hack)
      (advice-add #'shackle-display-buffer :around #'shackle-display-buffer-hack))

    ;; HACK: compatibility issue with `org-switch-to-buffer-other-window'
    (advice-add #'org-switch-to-buffer-other-window :override #'switch-to-buffer-other-window)

    ;; rules
    (setq shackle-default-size 0.4
          shackle-default-alignment 'below
          shackle-default-rule nil
          shackle-rules
          '((("*Help*" "*Apropos*") :select t :size 0.3 :align 'below :autoclose t)
            (compilation-mode :select t :size 0.3 :align 'below :autoclose t)
            (comint-mode :select t :size 0.4 :align 'below :autoclose t)
            ("*Completions*" :size 0.3 :align 'below :autoclose t)
            ("*Pp Eval Output*" :size 15 :align 'below :autoclose t)
            ("*Backtrace*" :select t :size 15 :align 'below)
            (("*Warnings*" "*Messages*") :size 0.3 :align 'below :autoclose t)
            ("^\\*.*Shell Command.*\\*$" :regexp t :size 0.3 :align 'below :autoclose t)
            ("\\*[Wo]*Man.*\\*" :regexp t :select t :align 'below :autoclose t)
            ("*Calendar*" :select t :size 0.3 :align 'below)
            ;; (("*shell*" "*eshell*" "*ielm*") :popup t :size 0.3 :align 'below)
            ("^\\*vc-.*\\*$" :regexp t :size 0.3 :align 'below :autoclose t)
            ("*gud-debug*" :select t :size 0.4 :align 'below :autoclose t)
            ("\\*ivy-occur .*\\*" :regexp t :select t :size 0.3 :align 'below)
            (" *undo-tree*" :select t)
            ("*quickrun*" :select t :size 15 :align 'below)
            ("*tldr*" :size 0.4 :align 'below :autoclose t)
            ("*osx-dictionary*" :size 20 :align 'below :autoclose t)
            ("*Youdao Dictionary*" :size 15 :align 'below :autoclose t)
            ("*Finder*" :select t :size 0.3 :align 'below :autoclose t)
            ("^\\*macro expansion\\**" :regexp t :size 0.4 :align 'below)
            ("^\\*elfeed-entry" :regexp t :size 0.7 :align 'below :autoclose t)
            (" *Install vterm* " :size 0.35 :same t :align 'below)
            (("*Paradox Report*" "*package update results*") :size 0.2 :align 'below :autoclose t)
            ("*Package-Lint*" :size 0.4 :align 'below :autoclose t)
            (("*Gofmt Errors*" "*Go Test*") :select t :size 0.3 :align 'below :autoclose t)
            ("*How Do You*" :select t :size 0.5 :align 'below :autoclose t)

            (("*Org Agenda*" " *Agenda Commands*" " *Org todo*" "*Org Dashboard*" "*Org Select*") :select t :size 0.1 :align 'below :autoclose t)
            (("\\*Capture\\*" "^CAPTURE-.*\\.org*") :regexp t :select t :size 0.3 :align 'below :autoclose t)

            ("*ert*" :size 15 :align 'below :autoclose t)
            (overseer-buffer-mode :size 15 :align 'below :autoclose t)

            (" *Flycheck checkers*" :select t :size 0.3 :align 'below :autoclose t)
            ((flycheck-error-list-mode flymake-diagnostics-buffer-mode)
             :select t :size 0.25 :align 'below :autoclose t)

            (("*lsp-help*" "*lsp session*") :size 0.3 :align 'below :autoclose t)
            ("*DAP Templates*" :select t :size 0.4 :align 'below :autoclose t)
            (dap-server-log-mode :size 15 :align 'below :autoclose t)
            ("*rustfmt*" :select t :size 0.3 :align 'below :autoclose t)
            ((rustic-compilation-mode rustic-cargo-clippy-mode rustic-cargo-outdated-mode rustic-cargo-test-mode) :select t :size 0.3 :align 'below :autoclose t)

            (profiler-report-mode :select t :size 0.5 :align 'below)
            ("*ELP Profiling Restuls*" :select t :size 0.5 :align 'below)

            ((inferior-python-mode inf-ruby-mode swift-repl-mode) :size 0.4 :align 'below)
            ("*prolog*" :size 0.4 :align 'below)

            ((grep-mode rg-mode deadgrep-mode ag-mode pt-mode) :select t :size 0.4 :align 'below)
            (Buffer-menu-mode :select t :size 20 :align 'below :autoclose t)
            (gnus-article-mode :select t :size 0.7 :align 'below :autoclose t)
            (helpful-mode :select t :size 0.3 :align 'below :autoclose t)
            ((process-menu-mode cargo-process-mode) :select t :size 0.3 :align 'below :autoclose t)
            (list-environment-mode :select t :size 0.3 :align 'below :autoclose t)
            (tabulated-list-mode :size 0.4 :align 'below))))

#+end_src

** End

#+begin_src emacs-lisp :tangle ./lisp/init-window.el

  (provide 'init-window)
	
#+end_src

* Snippets

Snippets configurations.

** Header

#+begin_src emacs-lisp :tangle ./lisp/init-snippets.el

  ;; -*- lexical-binding: t -*-

  (require 'warnings)

#+end_src

** yasnippet

#+begin_src emacs-lisp :tangle ./lisp/init-snippets.el

  (use-package yasnippet
    :diminish yas-minor-mode
    :hook (after-init . yas-global-mode)
    :config
    (add-to-list 'warning-suppress-types '(yasnippet backquote-change))

    (defun my/delete-one-blank-line ()
      (interactive)
      (save-excursion
        (if (re-search-forward "^[[:space:]]*$" nil t)
            (kill-whole-line)))))

#+end_src

